Public Attributes | List of all members
API_RoofQuantity Struct Reference
Element Manager
Gives the different calculated values for roofs. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | bottomSurface
bottom surface of the roof
 double  | topSurface
top surface of the roof
 double  | edgeSurface
edge surface of the roof
 double  | bottomSurface_cond
conditional bottom surface of the roof
 double  | topSurface_cond
conditional top surface of the roof
 double  | volume
volume of the roof
 double  | volume_cond
conditional volume of the roof
 double  | perimeter
perimeter of the roof
 double  | holesSurf
total area of holes in the roof
 double  | holesPrm
total perimeter of holes in the roof
 double  | grossBotSurf
Gross surface of the roof bottom.
 double  | grossTopSurf
Gross surface of the roof top.
 double  | grossEdgeSurf
Gross surface of the roof edges.
 double  | contourArea
The area of the roof contour polygon.
 double  | grossVolume
Gross volume of the roof.
 double  | insuThickness
roof insulation skin thickness
 double  | ridgesLength
length of Ridge type edges divided by 2
 double  | valleysLength
length of Valley type edges divided by 2
 double  | gablesLength
length of Gable type edges
 double  | hipsLength
length of Hip type edges divided by 2
 double  | eavesLength
length of Eave type edges
 double  | peaksLength
length of Peak type edges
 double  | sideWallConLength
length of SideWall type edges
 double  | endWallConLength
length of EndWall type edges
 double  | domeConLength
length of RTDome type edges divided by 2
 double  | hollowConLength
length of RTHollow type edges divided by 2
 double  | openingSurf
Sum of the surfaces of the roof openings.
 Int32  | numOfHoles
Number of holes in contour polygon.
 Int32  | numOfSkylight
Number of skylight.
Detailed Description
Gives the different calculated values for roofs.
Remarks
See also the roof parameters for listing in Appendix A of the GDL Reference manual.